faronov/cc2530-zigbee/tests/test_zcl_attributes.c
/* SPDX-License-Identifier: BSD-3-Clause
 * Copyright (c) 2026, cc2530-zigbee contributors. See LICENSE.
 */
#include "zcl_attributes.h"
#include "cc2530_mmio.h"

#include <stddef.h>
#include <string.h>

#define CHECK(condition) do { if (!(condition)) return (uint16_t)__LINE__; } while (0)

static const MCU_CODE uint8_t number[] = {0xef, 0xbe};
static const MCU_CODE uint8_t text[] = {'A', 0, 'z'};
static const MCU_CODE uint8_t long_data[255] = {0xa9, 0, 0x69};
static const MCU_CODE zcl_attribute_t code_attributes[] = {
    {0x1234, 1, {ZCL_TYPE_UINT16, 0, number, 2}},
    {0x2000, 1, {ZCL_TYPE_CHARACTER_STRING, 0, text, 3}},
    {0x3001, 0, {0xff, 0xff, NULL, 65535}},
    {0x0000, 1, {ZCL_TYPE_NO_DATA, 0, NULL, 0}},
    {0x4444, 1, {ZCL_TYPE_OCTET_STRING, 1, NULL, 0}}
};
static const MCU_CODE zcl_attribute_set_t code_set = {code_attributes, 5, 0, 0, 0xabcd};
static const MCU_CODE uint8_t golden_request[] = {
    0, 0x5a, 0, 0x34, 0x12, 0x99, 0x99, 0x01, 0x30, 0, 0, 0, 0x20, 0x44, 0x44, 0x34, 0x12
};
static const MCU_CODE uint8_t golden_response[] = {
    0x18, 0x5a, 1, 0x34, 0x12, 0, 0x21, 0xef, 0xbe,
    0x99, 0x99, 0x86, 0x01, 0x30, 0x7e, 0, 0, 0, 0,
    0, 0x20, 0, 0x42, 3, 'A', 0, 'z', 0x44, 0x44, 0, 0x41, 0xff,
    0x34, 0x12, 0, 0x21, 0xef, 0xbe
};
static zcl_attribute_t attributes[ZCL_ATTRIBUTE_MAX_COUNT + 1u];
static zcl_attribute_set_t set;
static zcl_read_info_t info;
static uint8_t request[102], response[102], raw[8];

static uint8_t filled(const uint8_t *bytes, uint16_t length, uint8_t value)
{
    while (length--)
        if (*bytes++ != value)
            return 0;
    return 1;
}

static void base(void)
{
    memset(attributes, 0, sizeof(attributes));
    memcpy(attributes, code_attributes, sizeof(code_attributes));
    set = code_set;
    set.attributes = attributes;
    memset(request, 0xee, sizeof(request));
    memcpy(request, golden_request, sizeof(golden_request));
    memset(response, 0xc7, sizeof(response));
    memset(&info, 0xa5, sizeof(info));
}

static uint16_t failure(uint16_t length, uint16_t capacity, zcl_codec_result_t expected)
{
    memset(response, 0xc7, sizeof(response));
    memset(&info, 0xa5, sizeof(info));
    CHECK(zcl_read_attrs_unicast(&set, request, length, response + 1, capacity, &info) == expected);
    CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)&info, sizeof(info), 0xa5));
    return 0;
}

static uint16_t golden_cases(void)
{
    uint8_t manufacturer, side, disable, offset;
    base();
    CHECK(zcl_read_attrs_unicast(&code_set, golden_request, sizeof(golden_request),
                                      response + 1, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == sizeof(golden_response) && info.command_id == 1);
    CHECK(info.requested_count == 7 && info.returned_count == 7);
    CHECK(memcmp(response + 1, golden_response, sizeof(golden_response)) == 0);
    CHECK(response[0] == 0xc7 && filled(response + 1 + info.length, 101u - info.length, 0xc7));
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        for (side = 0; side < 2; side++) {
            for (disable = 0; disable < 2; disable++) {
                base();
                set.manufacturer_specific = manufacturer;
                set.manufacturer_code = 0x5678;
                set.side = side;
                offset = manufacturer ? 5 : 3;
                request[0] = (uint8_t)((manufacturer ? 4u : 0xe0u) | (side ? 8u : 0u) | (disable ? 16u : 0u));
                if (manufacturer) {
                    request[1] = 0x78;
                    request[2] = 0x56;
                }
                request[offset - 2u] = 0x5a;
                request[offset - 1u] = 0;
                memcpy(request + offset, golden_request + 3, sizeof(golden_request) - 3u);
                CHECK(zcl_read_attrs_unicast(&set, request, (uint16_t)(offset + 14u),
                                                  response + 1, 100, &info) == ZCL_CODEC_OK);
                CHECK(info.length == offset + sizeof(golden_response) - 3u);
                CHECK(info.requested_count == 7 && info.returned_count == 7 && info.command_id == 1);
                CHECK(response[1] == (uint8_t)(0x10u | (manufacturer ? 4u : 0u) | (side ? 0u : 8u)));
                CHECK(response[offset - 1u] == 0x5a && response[offset] == 1);
                if (manufacturer)
                    CHECK(response[2] == 0x78 && response[3] == 0x56);
                CHECK(memcmp(response + 1 + offset, golden_response + 3, sizeof(golden_response) - 3u) == 0);
                CHECK(memcmp(request + offset, golden_request + 3, 14) == 0);
                CHECK(response[0] == 0xc7 && filled(response + 1 + info.length, 101u - info.length, 0xc7));
            }
        }
    }
    base();
    raw[0] = 0x55;
    raw[1] = 0xaa;
    attributes[0].value.data = raw;
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 9 && response[7] == 0x55 && response[8] == 0xaa);
    raw[0] = 0x69;
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(response[7] == 0x69 && raw[1] == 0xaa);
    return 0;
}

static uint16_t capacity_cases(void)
{
    uint8_t manufacturer, offset, capacity, count, i;
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        base();
        set.attributes = NULL;
        set.count = 0;
        set.manufacturer_specific = manufacturer;
        set.manufacturer_code = 0x5678;
        offset = manufacturer ? 5 : 3;
        memset(request, 0xee, sizeof(request));
        request[0] = manufacturer ? 4 : 0;
        request[1] = 0x78;
        request[2] = 0x56;
        request[offset - 2u] = 0x5a;
        request[offset - 1u] = 0;
        for (capacity = 0; capacity <= 100; capacity++) {
            if (capacity < offset + 3u) {
                CHECK(failure(99, capacity, ZCL_CODEC_BUFFER_TOO_SMALL) == 0);
                continue;
            }
            memset(response, 0xc7, sizeof(response));
            CHECK(zcl_read_attrs_unicast(&set, request, 99, response + 1, capacity, &info) == ZCL_CODEC_OK);
            count = (uint8_t)((capacity - offset) / 3u);
            CHECK(info.length == offset + 3u * count && info.returned_count == count);
            CHECK(info.requested_count == (99u - offset) / 2u && info.command_id == 1);
            for (i = 0; i < count; i++) {
                CHECK(response[1u + offset + i * 3u] == 0xee && response[2u + offset + i * 3u] == 0xee);
                CHECK(response[3u + offset + i * 3u] == 0x86);
            }
            CHECK(response[0] == 0xc7 && filled(response + 1 + info.length, 101u - info.length, 0xc7));
        }
    }
    base();
    request[5] = 0;
    request[6] = 0x20;
    request[7] = 0x99;
    request[8] = 0x99;
    CHECK(zcl_read_attrs_unicast(&set, request, 9, response, 15, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 15 && info.requested_count == 3 && info.returned_count == 3);
    CHECK(memcmp(response, golden_response, 9) == 0);
    CHECK(response[9] == 0 && response[10] == 0x20 && response[11] == 0x89);
    CHECK(response[12] == 0x99 && response[13] == 0x99 && response[14] == 0x86);
    CHECK(zcl_read_attrs_unicast(&set, request, 9, response, 14, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 12 && info.returned_count == 2 && response[11] == 0x89);
    CHECK(zcl_read_attrs_unicast(&set, request, 9, response, 8, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 6 && info.returned_count == 1 && response[5] == 0x89);
    request[3] = request[4] = 0;
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 6, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 6 && response[5] == 0x89);
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 7, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 7 && response[5] == 0 && response[6] == 0);
    base();
    attributes[0].value.type = ZCL_TYPE_OCTET_STRING;
    attributes[0].value.data = long_data;
    attributes[0].value.data_length = 254;
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 6 && info.returned_count == 1 && response[5] == 0x89);
    attributes[0].value.data_length = 255;
    CHECK(failure(5, 100, ZCL_CODEC_TOO_LONG) == 0);
    return 0;
}

