faronov/cc2530-zigbee/tests/test_zcl_attributes.c
static uint16_t rejection_cases(void)
{
    uint8_t length, i;
    base();
    for (length = 0; length < 3; length++)
        CHECK(failure(length, 100, ZCL_CODEC_TRUNCATED) == 0);
    CHECK(failure(101, 100, ZCL_CODEC_TOO_LONG) == 0);
    for (length = 3; length <= 8; length++) {
        if (length != 3 && ((length - 3u) & 1u) == 0)
            continue;
        CHECK(failure(length, 4, ZCL_CODEC_BUFFER_TOO_SMALL) == 0);
        CHECK(zcl_read_attrs_unicast(&set, request, length, response, 5, &info) == ZCL_CODEC_OK);
        CHECK(info.length == 5 && info.command_id == 0x0b && info.requested_count == 0 && info.returned_count == 0);
        CHECK(response[0] == 0x18 && response[1] == 0x5a && response[2] == 0x0b);
        CHECK(response[3] == 0 && response[4] == 0x80);
    }
    request[0] = 0x10;
    CHECK(zcl_read_attrs_unicast(&set, request, 4, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.command_id == 0x0b && response[4] == 0x80);
    request[0] = 8;
    CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    request[0] = 4;
    request[1] = 0x78;
    request[2] = 0x56;
    request[3] = 0x5a;
    request[4] = 0;
    CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    set.manufacturer_specific = 1;
    set.manufacturer_code = 0x5679;
    CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    set.manufacturer_code = 0x5678;
    CHECK(zcl_read_attrs_unicast(&set, request, 6, response, 7, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 7 && info.command_id == 0x0b && response[0] == 0x1c);
    CHECK(response[1] == 0x78 && response[2] == 0x56 && response[3] == 0x5a && response[5] == 0 && response[6] == 0x80);
    request[0] = 0xe4;
    CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_LAYOUT) == 0);
    base();
    request[0] = 1;
    CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_COMMAND) == 0);
    request[0] = 2;
    CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_FRAME_TYPE) == 0);
    request[0] = 0;
    request[2] = 0x0b;
    CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_COMMAND) == 0);
    base();
    attributes[1].id = attributes[0].id;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    attributes[4].readable = 2;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    set.count = ZCL_ATTRIBUTE_MAX_COUNT + 1u;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    set.count = ZCL_ATTRIBUTE_MAX_COUNT;
    for (i = 0; i < set.count; i++) {
        attributes[i].id = i;
        attributes[i].readable = 0;
    }
    request[3] = ZCL_ATTRIBUTE_MAX_COUNT - 1u;
    request[4] = 0;
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.length == 6 && response[3] == ZCL_ATTRIBUTE_MAX_COUNT - 1u && response[5] == 0x7e);
    set.attributes = NULL;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    set.side = 2;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    set.side = 0;
    set.manufacturer_specific = 2;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_TABLE) == 0);
    base();
    attributes[1].value.type = 0xff;
    request[5] = 0;
    request[6] = 0x20;
    CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_DATA_TYPE) == 0);
    CHECK(zcl_read_attrs_unicast(&set, request, 6, response, 100, &info) == ZCL_CODEC_OK);
    CHECK(info.command_id == 0x0b && response[4] == 0x80);
    attributes[0].value.data = NULL;
    CHECK(failure(5, 100, ZCL_CODEC_INVALID_ARGUMENT) == 0);
    base();
    raw[0] = 2;
    attributes[0].value.type = ZCL_TYPE_BOOLEAN;
    attributes[0].value.data = raw;
    attributes[0].value.data_length = 1;
    CHECK(failure(5, 6, ZCL_CODEC_INVALID_VALUE) == 0);
    CHECK(zcl_read_attrs_unicast(NULL, request, 5, response, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_read_attrs_unicast(&set, NULL, 5, response, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_read_attrs_unicast(&set, request, 5, NULL, 100, &info) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, NULL) == ZCL_CODEC_INVALID_ARGUMENT);
    CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)&info, sizeof(info), 0xa5));
    return 0;
}

static uint16_t value_cases(void)
{
    uint16_t type;
    uint8_t size, supported;
    base();
    set.count = 1;
    memset(raw, 0, sizeof(raw));
    attributes[0].value.data = raw;
    for (type = 0; type < 256; type++) {
        size = 0;
        supported = 1;
        if (type >= 0x08 && type <= 0x0f)
            size = (uint8_t)(type - 7u);
        else if (type >= 0x18 && type <= 0x2f)
            size = (uint8_t)((type & 7u) + 1u);
        else if (type == 0x10 || type == 0x30)
            size = 1;
        else if (type == 0x31)
            size = 2;
        else if (type == 0x41 || type == 0x42)
            size = 3;
        else if (type != 0)
            supported = 0;
        attributes[0].value.type = (uint8_t)type;
        attributes[0].value.data_length = size;
        if (!supported) {
            CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_DATA_TYPE) == 0);
        } else {
            CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
            CHECK(info.returned_count == 1 && info.requested_count == 1 && info.command_id == 1);
            CHECK(response[3] == 0x34 && response[4] == 0x12 && response[5] == 0 && response[6] == type);
            CHECK(info.length == 7u + size + (type == 0x41 || type == 0x42 ? 1u : 0u));
            if (type == 0x41 || type == 0x42)
                CHECK(response[7] == size && filled(response + 8, size, 0));
            else
                CHECK(filled(response + 7, size, 0));
        }
    }
    return 0;
}

static uint16_t identifier_cases(void)
{
    static const MCU_CODE uint16_t identifiers[] = {0x4fff, 0x5000, 0xefff, 0xf000, 0xfffe, 0xffff};
    volatile uint8_t manufacturer, i, offset;
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        for (i = 0; i < sizeof(identifiers) / sizeof(identifiers[0]); i++) {
            base();
            set.count = 2;
            set.manufacturer_specific = manufacturer;
            attributes[1] = attributes[0];
            attributes[1].id = identifiers[i];
            offset = manufacturer ? 5 : 3;
            request[0] = manufacturer ? 4 : 0;
            request[1] = 0xcd;
            request[2] = 0xab;
            request[offset - 2u] = 0x5a;
            request[offset - 1u] = 0;
            request[offset] = 0x34;
            request[offset + 1u] = 0x12;
            request[offset + 2u] = (uint8_t)identifiers[i];
            request[offset + 3u] = (uint8_t)(identifiers[i] >> 8);
            if (!manufacturer && (i == 1 || i == 2 || i == 5)) {
                CHECK(failure((uint16_t)(offset + 4u), 100, ZCL_CODEC_INVALID_TABLE) == 0);
                attributes[1].readable = 0;
                CHECK(failure((uint16_t)(offset + 2u), 100, ZCL_CODEC_INVALID_TABLE) == 0);
            } else {
                CHECK(zcl_read_attrs_unicast(&set, request, (uint16_t)(offset + 4u),
                                             response, 100, &info) == ZCL_CODEC_OK);
                CHECK(info.length == offset + 12u && info.requested_count == 2 && info.returned_count == 2);
                CHECK(response[offset] == 0x34 && response[offset + 1u] == 0x12 && response[offset + 2u] == 0);
                CHECK(response[offset + 6u] == request[offset + 2u] && response[offset + 7u] == request[offset + 3u]);
                CHECK(response[offset + 8u] == 0 && response[offset + 9u] == 0x21);
                CHECK(response[offset + 10u] == 0xef && response[offset + 11u] == 0xbe);
            }
            CHECK(attributes[0].id == 0x1234 && attributes[1].id == identifiers[i]);
            set.count = 1;
            CHECK(zcl_read_attrs_unicast(&set, request, (uint16_t)(offset + 4u),
                                         response, 100, &info) == ZCL_CODEC_OK);
            CHECK(info.length == offset + 9u && info.returned_count == 2);
            CHECK(response[offset + 6u] == request[offset + 2u] && response[offset + 7u] == request[offset + 3u]);
            CHECK(response[offset + 8u] == ZCL_STATUS_UNSUPPORTED_ATTRIBUTE);
        }
    }
    return 0;
}

static uint16_t run_tests(void)
{
    uint16_t result = golden_cases();
    if (result == 0) result = capacity_cases();
    if (result == 0) result = rejection_cases();
    if (result == 0) result = value_cases();
    if (result == 0) result = identifier_cases();
    return result;
}

#ifndef CC2530_HOST_TEST
volatile MCU_XDATA MCU_AT(0x1e00) uint8_t zcl_attributes_test_result[8];

void main(void)
{
    uint16_t result = run_tests();
    zcl_attributes_test_result[0] = 'Z';
    zcl_attributes_test_result[1] = 'C';
    zcl_attributes_test_result[2] = 'A';
    zcl_attributes_test_result[3] = '1';
    zcl_attributes_test_result[4] = 1;
    zcl_attributes_test_result[5] = 8;
    zcl_attributes_test_result[6] = (uint8_t)result;
    zcl_attributes_test_result[7] = (uint8_t)(result >> 8);
    __asm
        .globl _zcl_attributes_test_done
    _zcl_attributes_test_done:
        nop
    __endasm;
    for (;;) {}
}
#else
#include <stdio.h>
#include <stdlib.h>

static uint16_t model_and_header_matrix(void)
{
    zcl_attribute_t *table;
    uint8_t *data;
    uint32_t n;
    size_t table_bytes;
    unsigned count, i, offset, accepted = 0;
    zcl_codec_result_t status;
    data = malloc(2);
    CHECK(data != NULL);
    data[0] = 0xef;
    data[1] = 0xbe;
    for (count = 0; count <= ZCL_ATTRIBUTE_MAX_COUNT; count++) {
        base();
        table_bytes = count ? count * sizeof(*table) : 1u;
        table = malloc(table_bytes);
        CHECK(table != NULL);
        memset(table, 0, table_bytes);
        for (i = 0; i < count; i++) {
            table[i].id = (uint16_t)(0x1000u + i);
            table[i].readable = 1;
            table[i].value.type = ZCL_TYPE_UINT16;
            table[i].value.data = data;
            table[i].value.data_length = 2;
        }
        set.attributes = table;
        set.count = (uint8_t)count;
        for (n = 0; n < (count == ZCL_ATTRIBUTE_MAX_COUNT ? 65536UL : count + 1u); n++) {
            request[3] = (uint8_t)n;
            request[4] = count == ZCL_ATTRIBUTE_MAX_COUNT ? (uint8_t)(n >> 8) : 0x10;
            CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
            CHECK(info.command_id == 1 && info.requested_count == 1 && info.returned_count == 1);
            CHECK(response[3] == request[3] && response[4] == request[4]);
            if (count == ZCL_ATTRIBUTE_MAX_COUNT ? n >= 0x1000u && n < 0x1010u : n < count) {
                CHECK(info.length == 9 && response[5] == 0 && response[6] == 0x21 && response[7] == 0xef && response[8] == 0xbe);
            } else {
                CHECK(info.length == 6 && response[5] == 0x86);
            }
        }
        free(table);
    }
    free(data);
    base();
    for (n = 0; n < 256; n++) {
        request[0] = (uint8_t)n;
        set.side = (uint8_t)((n >> 3) & 1u);
        set.manufacturer_specific = (uint8_t)((n >> 2) & 1u);
        set.manufacturer_code = 0x5678;
        offset = set.manufacturer_specific ? 5u : 3u;
        request[1] = 0x78;
        request[2] = 0x56;
        request[offset - 2u] = 0x5a;
        request[offset - 1u] = 0;
        request[offset] = 0x34;
        request[offset + 1u] = 0x12;
        memset(response, 0xc7, sizeof(response));
        memset(&info, 0xa5, sizeof(info));
        status = zcl_read_attrs_unicast(&set, request, (uint16_t)(offset + 2u), response, 100, &info);
        if ((n & 3u) == 0 && (!(n & 4u) || !(n & 0xe0u))) {
            CHECK(status == ZCL_CODEC_OK && info.length == offset + 6u);
            CHECK(response[0] == (uint8_t)(((n & 0x1cu) ^ 8u) | 0x10u));
            accepted++;
        } else {
            CHECK(status != ZCL_CODEC_OK && filled(response, sizeof(response), 0xc7));
            CHECK(filled((const uint8_t *)&info, sizeof(info), 0xa5));
        }
    }
    CHECK(accepted == 36);
    base();
    for (n = 0; n < 256; n++) {
        request[2] = (uint8_t)n;
        if (n == 0) {
            CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
        } else {
            CHECK(failure(5, 100, ZCL_CODEC_UNSUPPORTED_COMMAND) == 0);
        }
        request[2] = 0;
        request[1] = (uint8_t)n;
        CHECK(zcl_read_attrs_unicast(&set, request, 5, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(response[1] == n && response[2] == 1);
    }
    set.manufacturer_specific = 1;
    request[0] = 4;
    request[3] = 0x5a;
    request[4] = 0;
    request[5] = 0x34;
    request[6] = 0x12;
    for (n = 0; n <= 65535UL; n++) {
        set.manufacturer_code = (uint16_t)n;
        request[1] = (uint8_t)n;
        request[2] = (uint8_t)(n >> 8);
        CHECK(zcl_read_attrs_unicast(&set, request, 7, response, 100, &info) == ZCL_CODEC_OK);
        CHECK(info.length == 11 && response[0] == 0x1c && response[1] == request[1] && response[2] == request[2]);
        set.manufacturer_code ^= 1u;
        CHECK(failure(7, 100, ZCL_CODEC_UNSUPPORTED_CONTEXT) == 0);
    }
    return 0;
}

