faronov/cc2530-zigbee/tests/test_zcl_attributes.c
static uint16_t exact_bounds(void)
{
    uint8_t *input, *output;
    zcl_read_info_t *result;
    unsigned manufacturer, size, capacity, offset, count, requested, used, i;
    uint32_t n;
    zcl_codec_result_t expected;
    result = malloc(sizeof(*result));
    CHECK(result != NULL);
    for (manufacturer = 0; manufacturer < 2; manufacturer++) {
        base();
        set.attributes = NULL;
        set.count = 0;
        set.manufacturer_specific = (uint8_t)manufacturer;
        set.manufacturer_code = 0x5678;
        offset = manufacturer ? 5u : 3u;
        for (size = 0; size <= 101; size++) {
            input = malloc(size ? size : 1u);
            CHECK(input != NULL);
            memset(request, 0xee, sizeof(request));
            request[0] = manufacturer ? 4 : 0;
            request[1] = 0x78;
            request[2] = 0x56;
            request[offset - 2u] = 0x5a;
            request[offset - 1u] = 0;
            memcpy(input, request, size);
            for (capacity = 0; capacity <= 102; capacity++) {
                output = malloc(capacity ? capacity : 1u);
                CHECK(output != NULL);
                memset(output, 0xc7, capacity);
                memset(result, 0xa5, sizeof(*result));
                requested = size >= offset ? (size - offset) / 2u : 0;
                expected = size > 100 ? ZCL_CODEC_TOO_LONG : size < offset ? ZCL_CODEC_TRUNCATED : ZCL_CODEC_OK;
                if (expected == ZCL_CODEC_OK && capacity < offset + ((size == offset || (size - offset) % 2u) ? 2u : 3u))
                    expected = ZCL_CODEC_BUFFER_TOO_SMALL;
                CHECK(zcl_read_attrs_unicast(&set, input, (uint16_t)size, output, (uint16_t)capacity, result) == expected);
                CHECK(memcmp(input, request, size) == 0);
                if (expected != ZCL_CODEC_OK) {
                    CHECK(filled(output, (uint16_t)capacity, 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
                } else {
                    CHECK(output[0] == (manufacturer ? 0x1cu : 0x18u) && output[offset - 2u] == 0x5a);
                    if (manufacturer)
                        CHECK(output[1] == 0x78 && output[2] == 0x56);
                    if (size == offset || (size - offset) % 2u) {
                        CHECK(result->command_id == 0x0b && result->requested_count == 0 && result->returned_count == 0);
                        CHECK(output[offset - 1u] == 0x0b && output[offset] == 0 && output[offset + 1u] == 0x80);
                        used = offset + 2u;
                    } else {
                        count = ((capacity < 100 ? capacity : 100u) - offset) / 3u;
                        if (count > requested) count = requested;
                        CHECK(result->command_id == 1 && result->requested_count == requested && result->returned_count == count);
                        CHECK(output[offset - 1u] == 1);
                        for (i = 0; i < count; i++)
                            CHECK(output[offset + i * 3u] == 0xee && output[offset + i * 3u + 1u] == 0xee && output[offset + i * 3u + 2u] == 0x86);
                        used = offset + 3u * count;
                    }
                    CHECK(result->length == used && filled(output + used, (uint16_t)(capacity - used), 0xc7));
                }
                free(output);
            }
            free(input);
        }
    }
    base();
    set.attributes = NULL;
    set.count = 0;
    input = malloc(65535);
    output = malloc(65535);
    CHECK(input != NULL && output != NULL);
    memset(input, 0xee, 65535);
    input[0] = 0;
    input[1] = 0x5a;
    input[2] = 0;
    memset(output, 0xc7, 65535);
    for (n = 0; n <= 65535UL; n++) {
        memset(result, 0xa5, sizeof(*result));
        expected = n < 6 ? ZCL_CODEC_BUFFER_TOO_SMALL : ZCL_CODEC_OK;
        CHECK(zcl_read_attrs_unicast(&set, input, 5, output, (uint16_t)n, result) == expected);
        if (expected == ZCL_CODEC_OK)
            CHECK(result->length == 6 && result->requested_count == 1 && result->returned_count == 1 && output[5] == 0x86);
        else
            CHECK(filled(output, 6, 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
        if (n > 100) {
            memset(response, 0xc7, sizeof(response));
            memset(result, 0xa5, sizeof(*result));
            CHECK(zcl_read_attrs_unicast(&set, input, (uint16_t)n, response, 100, result) == ZCL_CODEC_TOO_LONG);
            CHECK(filled(response, sizeof(response), 0xc7) && filled((const uint8_t *)result, sizeof(*result), 0xa5));
        }
    }
    CHECK(filled(output + 6, 65529, 0xc7));
    free(input);
    free(output);
    free(result);
    return 0;
}

int main(void)
{
    uint16_t result = run_tests();
    if (result == 0) result = model_and_header_matrix();
    if (result == 0) result = exact_bounds();
    if (result != 0) {
        fprintf(stderr, "ZCL Read Attributes test failed at C source line %u\n", result);
        return 1;
    }
    puts("ZCL Read Attributes: shared vectors, namespace/access/space rules and exact host bounds PASS.");
    return 0;
}
#endif
